tqkhcmut/FEP_F4/Drivers/Ethernet/stm32_eth_bsp.c
/* Includes ------------------------------------------------------------------*/
#include "lwip/opt.h"
#include "stm32_eth.h"
#include "stm32_eth_conf.h"
#include "stm32_eth_bsp.h"
#include "drivers.h"
#include "lwip/netif.h"
#include "netconf.h"
#include "lwip/dhcp.h"

/* Scheduler includes */
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"

#include <string.h>

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* The time to block waiting for input. */
#define ETH_LINK_TASK_STACK_SIZE		( configMINIMAL_STACK_SIZE * 2 )
#define ETH_LINK_TASK_PRIORITY		        ( tskIDLE_PRIORITY + 3 )
#define emacBLOCK_TIME_WAITING_ETH_LINK_IT	( ( portTickType ) 100 )
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
ETH_InitTypeDef ETH_InitStructure;
__IO uint32_t  EthStatus = 0;
extern struct netif xnetif;
#ifdef USE_DHCP
extern __IO uint8_t DHCP_state;
#endif /* LWIP_DHCP */
xSemaphoreHandle ETH_link_xSemaphore = NULL;

/* Private function prototypes -----------------------------------------------*/
static void ETH_GPIO_Config(void);
static void ETH_NVIC_Config(void);
static void ETH_MACDMA_Config(void);

/* Private functions ---------------------------------------------------------*/

/**
* @brief  ETH_BSP_Config
* @param  None
* @retval None
*/
void ETH_BSP_Config(void)
{
	/* Configure the GPIO ports for ethernet pins */
	ETH_GPIO_Config();
	
	/* Config NVIC for Ethernet */
	ETH_NVIC_Config();
	
	/* Configure the Ethernet MAC/DMA */
	ETH_MACDMA_Config();
	
	/* Get Ethernet link status*/
	if(ETH_ReadPHYRegister(DP83848_PHY_ADDRESS, PHY_SR) & 1)
	{
		EthStatus |= ETH_LINK_FLAG;
	}
	
	/* Configure the PHY to generate an interrupt on change of link status */
	Eth_Link_PHYITConfig(DP83848_PHY_ADDRESS);
	
	/* Configure the EXTI for Ethernet link status. */
	Eth_Link_EXTIConfig();
	
	if (ETH_link_xSemaphore == NULL)
	{
		/* create binary semaphore used for ETH_link handling */
		vSemaphoreCreateBinary( ETH_link_xSemaphore );
	}
	
	/* create the task that handles the ETH_link */
	xTaskCreate(Eth_Link_IT_task, "E_link", ETH_LINK_TASK_STACK_SIZE, (void *)DP83848_PHY_ADDRESS,
				ETH_LINK_TASK_PRIORITY,NULL);
}

/**
* @brief  Configures the Ethernet Interface
* @param  None
* @retval None
*/
static void ETH_MACDMA_Config(void)
{ 
	/* Enable ETHERNET clock  */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_ETH_MAC | RCC_AHB1Periph_ETH_MAC_Tx |
						   RCC_AHB1Periph_ETH_MAC_Rx, ENABLE);
	
	/* Reset ETHERNET on AHB Bus */
	ETH_DeInit();
	
	/* Software reset */
	ETH_SoftwareReset();
	
	/* Wait for software reset */
	while (ETH_GetSoftwareResetStatus() == SET);
	
	/* ETHERNET Configuration --------------------------------------------------*/
	/* Call ETH_StructInit if you don't like to configure all ETH_InitStructure parameter */
	ETH_StructInit(&ETH_InitStructure);
	
	/* Fill ETH_InitStructure parametrs */
	/*------------------------   MAC   -----------------------------------*/
	ETH_InitStructure.ETH_AutoNegotiation = ETH_AutoNegotiation_Enable;
	//  ETH_InitStructure.ETH_AutoNegotiation = ETH_AutoNegotiation_Disable; 
	//  ETH_InitStructure.ETH_Speed = ETH_Speed_10M;
	//  ETH_InitStructure.ETH_Mode = ETH_Mode_FullDuplex;
	
	ETH_InitStructure.ETH_LoopbackMode = ETH_LoopbackMode_Disable;
	ETH_InitStructure.ETH_RetryTransmission = ETH_RetryTransmission_Disable;
	ETH_InitStructure.ETH_AutomaticPadCRCStrip = ETH_AutomaticPadCRCStrip_Disable;
	ETH_InitStructure.ETH_ReceiveAll = ETH_ReceiveAll_Disable;
	ETH_InitStructure.ETH_BroadcastFramesReception = ETH_BroadcastFramesReception_Enable;
	ETH_InitStructure.ETH_PromiscuousMode = ETH_PromiscuousMode_Disable;
	ETH_InitStructure.ETH_MulticastFramesFilter = ETH_MulticastFramesFilter_Perfect;
	ETH_InitStructure.ETH_UnicastFramesFilter = ETH_UnicastFramesFilter_Perfect;
#ifdef CHECKSUM_BY_HARDWARE
	ETH_InitStructure.ETH_ChecksumOffload = ETH_ChecksumOffload_Enable;
#endif
	
	/*------------------------   DMA   -----------------------------------*/  
	
	/* When we use the Checksum offload feature, we need to enable the Store and Forward mode: 
	the store and forward guarantee that a whole frame is stored in the FIFO, so the MAC can insert/verify the checksum, 
	if the checksum is OK the DMA can handle the frame otherwise the frame is dropped */
	ETH_InitStructure.ETH_DropTCPIPChecksumErrorFrame = ETH_DropTCPIPChecksumErrorFrame_Enable;
	ETH_InitStructure.ETH_ReceiveStoreForward = ETH_ReceiveStoreForward_Enable;
	ETH_InitStructure.ETH_TransmitStoreForward = ETH_TransmitStoreForward_Enable;
	
	ETH_InitStructure.ETH_ForwardErrorFrames = ETH_ForwardErrorFrames_Disable;
	ETH_InitStructure.ETH_ForwardUndersizedGoodFrames = ETH_ForwardUndersizedGoodFrames_Disable;
	ETH_InitStructure.ETH_SecondFrameOperate = ETH_SecondFrameOperate_Enable;
	ETH_InitStructure.ETH_AddressAlignedBeats = ETH_AddressAlignedBeats_Enable;
	ETH_InitStructure.ETH_FixedBurst = ETH_FixedBurst_Enable;
	ETH_InitStructure.ETH_RxDMABurstLength = ETH_RxDMABurstLength_32Beat;
	ETH_InitStructure.ETH_TxDMABurstLength = ETH_TxDMABurstLength_32Beat;
	ETH_InitStructure.ETH_DMAArbitration = ETH_DMAArbitration_RoundRobin_RxTx_2_1;
	
	/* Configure Ethernet */
	EthStatus = ETH_Init(&ETH_InitStructure, DP83848_PHY_ADDRESS);
	
	/* Enable the Ethernet Rx Interrupt */
	ETH_DMAITConfig(ETH_DMA_IT_NIS | ETH_DMA_IT_R, ENABLE);
}

/**
* @brief  Configures the different GPIO ports.
* @param  None
* @retval None
* @portable Redefine the GPIO port, pin or pheripheral base on your board
*/
void ETH_GPIO_Config(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	/* Enable GPIOs clocks */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA | RCC_AHB1Periph_GPIOB |
						   RCC_AHB1Periph_GPIOC , ENABLE);
	
	/* Enable SYSCFG clock */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
	
	/******************************* TQK Comments ****************************/
	// PA8 in ELEK STM32F107 board was used as error led output
	// and in ELEK STM32F429 board was not used
	// to make sure you have right config, undefine PHY_CLOCK_MCO pls!
	/******************************* TQK Comments ****************************/
#ifdef PHY_CLOCK_MCO	
	
	/* Configure MCO (PA8) */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL 
		GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif
	
	/******************************* TQK Comments ****************************/
	// ELEK STM32F107 board was used RMII interface
	// ELEK STM32F429 board used RMII interface too.
	/******************************* TQK Comments ****************************/
	
	/* MII/RMII Media interface selection --------------------------------------*/
#ifdef MII_MODE /* Mode MII with STM324xx-EVAL  */
#ifdef PHY_CLOCK_MCO
	
	/* Output HSE clock (16MHz) on MCO pin (PA8) to clock the PHY */
	RCC_MCO1Config(RCC_MCO1Source_HSE, RCC_MCO1Div_1);
#endif /* PHY_CLOCK_MCO */
	
	SYSCFG_ETH_MediaInterfaceConfig(SYSCFG_ETH_MediaInterface_MII);
#elif defined RMII_MODE  /* Mode RMII with STM32F102ELEK */
	
	SYSCFG_ETH_MediaInterfaceConfig(SYSCFG_ETH_MediaInterface_RMII);
#endif
	
	/******************************* TQK Comments ****************************/
	// these following lines was redefined base on ELEK STM32F107 board
	/******************************* TQK Comments ****************************/
	
	/* Ethernet pins configuration ************************************************/
	/*
	ETH_MDIO -------------------------> PA2
	ETH_MDC --------------------------> PC1
	ETH_PPS_OUT ----------------------> PB5 // SdCard_MOSI
	ETH_MII_CRS ----------------------> PA0 // WIFI_WFS
	ETH_MII_COL ----------------------> PA3 // WIFI_CS
	ETH_MII_RX_ER --------------------> PB10
	ETH_MII_RXD2 ---------------------> PB0 // Dali_Rx1
	ETH_MII_RXD3 ---------------------> PB1 // Dali_Tx1
	ETH_MII_TX_CLK -------------------> PC3	// Driver_Out1
	ETH_MII_TXD2 ---------------------> PC2 // Driver_Out2
	ETH_MII_TXD3 ---------------------> PB8
	ETH_MII_RX_CLK/ETH_RMII_REF_CLK---> PA1
	ETH_MII_RX_DV/ETH_RMII_CRS_DV ----> PA7
	ETH_MII_RXD0/ETH_RMII_RXD0 -------> PC4
	ETH_MII_RXD1/ETH_RMII_RXD1 -------> PC5
	ETH_MII_TX_EN/ETH_RMII_TX_EN -----> PB11
	ETH_MII_TXD0/ETH_RMII_TXD0 -------> PB12
	ETH_MII_TXD1/ETH_RMII_TXD1 -------> PB13
	*/
	
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;
	
	/* Configure PA1, PA2 and PA7 */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_7;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_ETH);
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_ETH);
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource7, GPIO_AF_ETH);
	
	/* Configure PB11, PB12 and PB13 */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_ETH);	
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource12, GPIO_AF_ETH);
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource13, GPIO_AF_ETH);
	
	/* Configure PC1, PC4 and PC5 */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_4 | GPIO_Pin_5;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	GPIO_PinAFConfig(GPIOC, GPIO_PinSource1, GPIO_AF_ETH);
	GPIO_PinAFConfig(GPIOC, GPIO_PinSource4, GPIO_AF_ETH);
	GPIO_PinAFConfig(GPIOC, GPIO_PinSource5, GPIO_AF_ETH);
}
/**
* @brief  Configures and enable the Ethernet global interrupt.
* @param  None
* @retval None
*/
void ETH_NVIC_Config(void)
{
	NVIC_InitTypeDef   NVIC_InitStructure; 
	
	/* Enable the Ethernet global Interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = ETH_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 12 ;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}

/**
* @brief  Configure the PHY to generate an interrupt on change of link status.
* @param PHYAddress: external PHY address  
* @retval None
*/
uint32_t Eth_Link_PHYITConfig(uint16_t PHYAddress)
{
	uint16_t tmpreg = 0;
	
	/* Read MICR register */
	tmpreg = ETH_ReadPHYRegister(PHYAddress, PHY_MICR);
	
	/* Enable output interrupt events to signal via the INT pin */
	tmpreg |= (uint16_t)PHY_MICR_INT_EN | PHY_MICR_INT_OE;
	if(!(ETH_WritePHYRegister(PHYAddress, PHY_MICR, tmpreg)))
	{
		/* Return ERROR in case of write timeout */
		return ETH_ERROR;
	}
	
	/* Read MISR register */
	tmpreg = ETH_ReadPHYRegister(PHYAddress, PHY_MISR);
	
	/* Enable Interrupt on change of link status */
	tmpreg |= (uint16_t)PHY_MISR_LINK_INT_EN;
	if(!(ETH_WritePHYRegister(PHYAddress, PHY_MISR, tmpreg)))
	{
		/* Return ERROR in case of write timeout */
		return ETH_ERROR;
	}
	/* Return SUCCESS */
	return ETH_SUCCESS;
}

/**
* @brief  EXTI configuration for Ethernet link status.
* @param PHYAddress: external PHY address  
* @retval None
*/
void Eth_Link_EXTIConfig(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	EXTI_InitTypeDef EXTI_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	
	/* Enable the INT (D11) Clock */
	RCC_AHB1PeriphClockCmd(ETH_LINK_GPIO_CLK, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
	
	/* Configure INT pin as input */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_InitStructure.GPIO_Pin = ETH_LINK_PIN;
	GPIO_Init(ETH_LINK_GPIO_PORT, &GPIO_InitStructure);
	
	/* Connect EXTI Line to INT Pin */
	SYSCFG_EXTILineConfig(ETH_LINK_EXTI_PORT_SOURCE, ETH_LINK_EXTI_PIN_SOURCE);
	
	/* Configure EXTI line */
	EXTI_InitStructure.EXTI_Line = ETH_LINK_EXTI_LINE;
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;  
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStructure);
	
	/* Enable and set the EXTI interrupt to priority 1*/
	NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 13;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}

/**
* @brief  This function handles Ethernet link status.
* @param  None
* @retval None
*/
void Eth_Link_IT_task( void * pvParameters )
{
	uint32_t pcPHYAddress;
	
	pcPHYAddress = ( uint32_t  ) pvParameters;
	
	for(;;)
	{
		if (xSemaphoreTake( ETH_link_xSemaphore, emacBLOCK_TIME_WAITING_ETH_LINK_IT)==pdTRUE)
		{
			/* Check whether the link interrupt has occurred or not */
			if(((ETH_ReadPHYRegister((uint16_t) pcPHYAddress, PHY_MISR)) & PHY_LINK_STATUS) != 0)
			{
				if((ETH_ReadPHYRegister((uint16_t) pcPHYAddress, PHY_SR) & 1))
				{
					netif_set_link_up(&xnetif);
				}
				else
				{
					netif_set_link_down(&xnetif);
				}
			}
		}
	}
}
/**
* @brief  Link callback function, this function is called on change of link status.
* @param  The network interface
* @retval None
*/
extern struct EthernetData ethData;
//extern void SyncEthernetData(SYNC_CMD_t cmd);
extern void ChangeStaticIP(void);
void ETH_link_callback(struct netif *netif)
{
	__IO uint32_t timeout = 0;
	uint32_t tmpreg,RegValue;
	
	struct ip_addr ipaddr;
	struct ip_addr netmask;
	struct ip_addr gw;
	
	if(netif_is_link_up(netif))
	{
		/* Restart the autonegotiation */
		if(ETH_InitStructure.ETH_AutoNegotiation != ETH_AutoNegotiation_Disable)
		{
			/* Reset Timeout counter */
			timeout = 0;
			
			/* Enable Auto-Negotiation */
			ETH_WritePHYRegister(DP83848_PHY_ADDRESS, PHY_BCR, PHY_AutoNegotiation);
			
			/* Wait until the auto-negotiation will be completed */
			do
			{
				timeout++;
			} while (!(ETH_ReadPHYRegister(DP83848_PHY_ADDRESS, PHY_BSR) & PHY_AutoNego_Complete) && (timeout < (uint32_t)PHY_READ_TO));
			
			/* Reset Timeout counter */
			timeout = 0;
			
			/* Read the result of the auto-negotiation */
			RegValue = ETH_ReadPHYRegister(DP83848_PHY_ADDRESS, PHY_SR);
			
			/* Configure the MAC with the Duplex Mode fixed by the auto-negotiation process */
			if((RegValue & PHY_DUPLEX_STATUS) != (uint32_t)RESET)
			{
				/* Set Ethernet duplex mode to Full-duplex following the auto-negotiation */
				ETH_InitStructure.ETH_Mode = ETH_Mode_FullDuplex;  
			}
			else
			{
				/* Set Ethernet duplex mode to Half-duplex following the auto-negotiation */
				ETH_InitStructure.ETH_Mode = ETH_Mode_HalfDuplex;
			}
			/* Configure the MAC with the speed fixed by the auto-negotiation process */
			if(RegValue & PHY_SPEED_STATUS)
			{
				/* Set Ethernet speed to 10M following the auto-negotiation */
				ETH_InitStructure.ETH_Speed = ETH_Speed_10M; 
			}
			else
			{
				/* Set Ethernet speed to 100M following the auto-negotiation */
				ETH_InitStructure.ETH_Speed = ETH_Speed_100M;      
			}
			
			/*------------------------ ETHERNET MACCR Re-Configuration --------------------*/
			/* Get the ETHERNET MACCR value */  
			tmpreg = ETH->MACCR;
			
			/* Set the FES bit according to ETH_Speed value */ 
			/* Set the DM bit according to ETH_Mode value */ 
			tmpreg |= (uint32_t)(ETH_InitStructure.ETH_Speed | ETH_InitStructure.ETH_Mode);
			
			/* Write to ETHERNET MACCR */
			ETH->MACCR = (uint32_t)tmpreg;
			
			_eth_delay_(ETH_REG_WRITE_DELAY);
			tmpreg = ETH->MACCR;
			ETH->MACCR = tmpreg;
		}
		
		/* Restart MAC interface */
		ETH_Start();
		
#ifdef USE_DHCP
		ipaddr.addr = 0;
		netmask.addr = 0;
		gw.addr = 0;
		DHCP_state = DHCP_START;
#else
		// load ethernet data from extern flash
//		SyncEthernetData(RESTORE);
		// 
		if (ethData._ip.addr == IPADDR_BROADCAST ||
			ethData._ip.addr == IPADDR_ANY ||
				!ip_addr_netmask_valid(&(ethData._subnet)))
		{
			IP4_ADDR(&(ethData._ip), IP_ADDR0, IP_ADDR1, IP_ADDR2, IP_ADDR3);
			IP4_ADDR(&(ethData._subnet), NETMASK_ADDR0, NETMASK_ADDR1 , NETMASK_ADDR2, NETMASK_ADDR3);
			IP4_ADDR(&(ethData._gateway), GW_ADDR0, GW_ADDR1, GW_ADDR2, GW_ADDR3);
		}
		//		IP4_ADDR(&ipaddr, IP_ADDR0, IP_ADDR1, IP_ADDR2, IP_ADDR3);
		//		IP4_ADDR(&netmask, NETMASK_ADDR0, NETMASK_ADDR1 , NETMASK_ADDR2, NETMASK_ADDR3);
		//		IP4_ADDR(&gw, GW_ADDR0, GW_ADDR1, GW_ADDR2, GW_ADDR3);
		ipaddr.addr = ethData._ip.addr;
		netmask.addr = ethData._subnet.addr;
		gw.addr = ethData._gateway.addr;
#endif /* USE_DHCP */
		
		// also change MAC address
		xnetif.hwaddr[5] = ip4_addr4(&ethData._ip.addr);
		ETH_MACAddressConfig(ETH_MAC_Address0, netif->hwaddr);
		netif_set_addr(&xnetif, &ipaddr , &netmask, &gw);
		
		/* When the netif is fully configured this function must be called.*/
		netif_set_up(&xnetif);    
		
		//		ChangeStaticIP();
	}
	else
	{
		ETH_Stop();
#ifdef USE_DHCP
		DHCP_state = DHCP_LINK_DOWN;
		dhcp_stop(netif);
#endif /* USE_DHCP */
		
		/*  When the netif link is down this function must be called.*/
		netif_set_down(&xnetif);
	}
	// notify buzzer
	struct BuzzerData data;
	data.State = 1;
	data.Life = 500;
	xQueueSend(BuzzerQueue, &data, 10);
	data.State = 0;
	data.Life = 0;
	xQueueSend(BuzzerQueue, &data, 10);
}
